In [2]:
import pandas as pd
import numpy as np

In [4]:
b=np.array([1,2,3,4,5,6])

In [5]:
pd.__version__

u'0.22.0'

In [6]:
b

array([1, 2, 3, 4, 5, 6])

In [7]:
df=pd.DataFrame([1,2,3])

In [8]:
df

   0
0  1
1  2
2  3

In [9]:
data=[['Alex',25],['Raaj',32],['Fabio',28]]
df2=pd.DataFrame(data,columns=['Name','Age'])

In [10]:
df2

    Name  Age
0   Alex   25
1   Raaj   32
2  Fabio   28

In [14]:
data=[['Alex',25],['Raaj',32],['Fabio',28]]
df2=pd.DataFrame(data,columns=['Name','Age'],dtype=float)
df2

    Name   Age
0   Alex  25.0
1   Raaj  32.0
2  Fabio  28.0

In [15]:
data=[['Alex',25],['Raaj',32],['Fabio',28]]
df2=pd.DataFrame(data,columns=['Name','Age'],index=[1,2,3])
df2

    Name  Age
1   Alex   25
2   Raaj   32
3  Fabio   28

In [16]:
data=[['Alex',25],['Raaj',32],['Fabio',28]]
df2=pd.DataFrame(data,columns=['Name','Age'],index=[1,2,3],dtype=int)
df2

    Name  Age
1   Alex   25
2   Raaj   32
3  Fabio   28

In [31]:
df3=pd.DataFrame([['Ajay','M',35],['Chicky','F',10],['Rishi','M',30]],columns=['Name','Sex','Age'],
                 index=['a','b','c'],dtype=int)
df3

     Name Sex  Age
a    Ajay   M   35
b  Chicky   F   10
c   Rishi   M   30

In [32]:
ds=pd.Series(['Ajay','Chicky','rajesh'],index=['A1','A2','A3'])
df4=pd.DataFrame(ds,columns=['Name'])
# print(ds)
print(df4)

      Name
A1    Ajay
A2  Chicky
A3  rajesh

In [35]:
df5=pd.DataFrame([['Akash','M',23],['Asish','M',24],['Akanskhya','F',21]],columns=['Name','Sex','Age'])
# df5.pop('Sex')
df5

        Name Sex  Age
0      Akash   M   23
1      Asish   M   24
2  Akanskhya   F   21

In [34]:
df5.pop('Age')
df5

        Name
0      Akash
1      Asish
2  Akanskhya

In [39]:
df6=pd.DataFrame([['Akash','M',23],['Asish','M',24],['Akanskhya','F',21]],columns=['Name','Sex','Age'])
df6.pop('Sex')
df6

        Name  Age
0      Akash   23
1      Asish   24
2  Akanskhya   21